package lab2;
//Напишите программу, которая проверяет, попадает ли введение пользователем число в диапазон от 5 до 10 включительно.
public class Example4 {
    public static void main(String[] args) {
      /*  int[] intArray1;
        intArray1 = new int[5]; //prisvaivanie ssilki peremennoy
        int[] intArray2 = {1,2,3,4,5}; //dobavlenie elements
        int intArray3 = new int[10]; // objavlenie massiva s zadannim razmerom

        for (int i = 0; i < intArray3.length; i++) { // cicle for dlya obj masive
            intArray3[i] = i+1;
            System.out.println(intArray3[i]);
        }
    }
}
*/


    }
}